fdr/src/test/resources/requests/nodoChiediFlussoRendicontazione.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns4:nodoChiediFlussoRendicontazione xmlns:ns4="http://ws.pagamenti.telematici.gov/" xmlns:ns3="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="http://ws.pagamenti.telematici.gov/ppthead">
            <identificativoIntermediarioPA>{brokerPa}</identificativoIntermediarioPA>
            <identificativoStazioneIntermediarioPA>{station}</identificativoStazioneIntermediarioPA>
            <password>{stationPwd}</password>
            <identificativoDominio>{pa}</identificativoDominio>
            <identificativoPSP>{psp}</identificativoPSP>
            <identificativoFlusso>{idflusso}</identificativoFlusso>
        </ns4:nodoChiediFlussoRendicontazione>
    </soap:Body>
</soap:Envelope>